/*Создайте программу, которая принимает три параметра 
в следующем порядке: имя файла и две строки, s1 и s2.
Она откроет файл <filename> и скопирует его содержимое 
в новый файл <filename>.replace, заменяя каждое вхождение s1 на s2.
Использование функций манипулирования файлами на 
языке C запрещено и будет считаться мошенничеством. 
Все функции-члены класса std::string разрешены, кроме replace. Используйте их с умом!
Конечно, обрабатывайте неожиданные входы и ошибки. 
Вы должны создавать и сдавать свои собственные тесты, 
чтобы убедиться, что ваша программа работает так, как ожидается.
 */